title: Execution From World Writable Temporary Directory
id: lab-process-execution-from-writable-tmp
status: test
description: Detecteaza procese lansate din /tmp, /var/tmp sau /dev/shm.
logsource:
  product: linux
  category: process_creation
detection:
  selection_tmp:
    event.category: process
    event.type: start
    process.executable|startswith:
      - "/tmp/"
      - "/var/tmp/"
      - "/dev/shm/"
  condition: selection_tmp
level: high
tags:
  - attack.defense_evasion
  - attack.t1036
