title: Suspicious Network Utility Execution
id: lab-process-suspicious-network-utility
status: test
description: Detecteaza executia unor utilitare frecvent folosite pentru transfer, pivotare sau reverse shell.
logsource:
  product: linux
  category: process_creation
detection:
  selection_tool:
    event.category: process
    event.type: start
    process.name:
      - nc
      - ncat
      - netcat
      - socat
  condition: selection_tool
level: high
tags:
  - attack.command_and_control
  - attack.t1105