title: Shell Inline Command Execution
id: lab-process-shell-inline-command
status: test
description: Detectează executia de comenzi inline prin shell, de forma sh/bash -c.
logsource:
  product: linux
  category: process_creation
detection:
  selection_shell:
    event.category: process
    event.type: start
    process.name:
      - sh
      - bash
      - dash
      - zsh
  selection_inline:
    process.args:
      - "-c"
  condition: selection_shell and selection_inline
level: low
tags:
  - attack.execution
  - attack.t1059